MusicApp/app/controllers/bands_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "user"], ["LIMIT", 1]]
---
  def find_member_id(username)
    member = User.find_by(username: username)